Tekla.Structures.Dialog.PluginWindowBase
The PluginWindowBase class is the base class for plug-in WPF dialogs. The class extends
the WindowBase class by adding communications with Tekla Structures.

Tekla.Structures.Dialog.PluginWindowBase.AttributesLoadedFromModel
The AttributesLoadedFromModel event is triggered just after the attributes have been loaded
from the model into the dialog.

Tekla.Structures.Dialog.PluginWindowBase.#ctor
Runs the WindowBase constructor and loads the default .NET localization file (DotNetDialogStrings.ail).
Datastorage is built based on given viewmodel object

Tekla.Structures.Dialog.PluginWindowBase.SetTemporaryDataStorage(Tekla.Structures.DialogInternal.DialogDataStorage)
Sets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Storage: The data storage class.

Tekla.Structures.Dialog.PluginWindowBase.SetModelDataStorage(Tekla.Structures.DialogInternal.DialogDataStorage)
Sets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Storage: The data storage class.

Tekla.Structures.Dialog.PluginWindowBase.GetTemporaryDataStorage(System.String)
Gets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
Key: The data storage class.

Tekla.Structures.Dialog.PluginWindowBase.SetViewModel(System.Object)
Sets the data storage class that communicates with Tekla Structures.
Handled by the Tekla.Structures.Dialog classes.
ViewModel: The data storage class.

Tekla.Structures.Dialog.PluginWindowBase.RemoveViewModelAndListeners
Removes the data storage class that communicates with Tekla Structures.

Tekla.Structures.Dialog.PluginWindowBase.DoShowWindow
Shows the dialog.

Tekla.Structures.Dialog.PluginWindowBase.DoLoad
It raises the Load event.

Tekla.Structures.Dialog.PluginWindowBase.DoInitializeWindow
Once per Tekla Structures execution registers the dialog and its fields to the Tekla Structures
Object Dialog tree. Loads the initial values from the standard file.

Tekla.Structures.Dialog.PluginWindowBase.ReloadWindow
Reloads the dialog values.

Tekla.Structures.Dialog.PluginWindowBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog values locally and
to the Tekla Structures Object Dialog tree.

Tekla.Structures.Dialog.PluginWindowBase.Modify
The method to call when the Modify button is clicked. Modifies the part that is currently selected in
Tekla Structures. First disables all the toggles in the object dialog tree, then enables the correct
ones by setting their values in WriteToDataStorage.

Tekla.Structures.Dialog.PluginWindowBase.Create
The method to call when the Create button is clicked.
This method is a wrapper which delegates the request to the Modify() method.

Tekla.Structures.Dialog.PluginWindowBase.Get
Gets the dialog values from the part that is currently selected in Tekla Structures.

Tekla.Structures.Dialog.PluginWindowBase.LoadValuesPath(System.String)
Retrieves the full path for the file name. Called from LoadValues.
Override this function in order to change the default load path OR to add additional
actions on LoadValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.PluginWindowBase.SaveValuesPath(System.String)
Retrieves the full path for the file name. Called from SaveValues.
Override this function in order to change the default save path OR to add additional
actions on SaveValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.PluginWindowBase.ShowInTaskbar
Hides (shadows) the ShowInTaskbar property by setting the property to false.